---
kind: property
id: P:Autodesk.Revit.DB.Macros.Macro.MacroModule
source: html/8693fc15-381a-4f24-51fe-f539c0c3ec9e.htm
---
# Autodesk.Revit.DB.Macros.Macro.MacroModule Property

The Macro module.

## Syntax (C#)
```csharp
public MacroModule MacroModule { get; }
```